#ifndef __INCLUDED_H_Fourier_Transform_Mat__
#define __INCLUDED_H_Fourier_Transform_Mat__

#include "main.h"

/*--- FTMatクラス -----------------------------------------------------
	Matクラスの画像を簡単にフーリエ変換するための画像クラス
	ImgMat <=(1次元化)=> ImgVec <=(DFT)=> dft_ImgVec
	ZeroPoint:		インデックスのゼロ点 (0:左上, 1:中心)
	IndexOrder:		インデックス順序 (0:ラスタスキャン, 1:逆ラスタスキャン)
	PaddingWay:		パディング手法 (0:BORDER_CONSTANT, 1:BORDER_REPLICATE)
	Cols, Rows, Size:		DFT前のサイズ
	Xsize, Ysize, XYsize:	DFT後のサイズ
-----------------------------------------------------------------------*/
class FTMat {
private:
	int x = 0, y = 0;
	int zeroX = 0, zeroY = 0, zeroIndex = 0;
public:
	Mat ImgMat;		// 2次元画像
	Mat ImgVec;		// 1次元化画像(Mat)
	Mat dft_ImgVec;	// 1次元化画像のフーリエ変換
	int Channels = 0;		// 画像のチャンネル数
	int ZeroPoint = 0;		// 1次元化の際のインデックスのゼロ点
	int IndexOrder = 0;		// 1次元化の際のインデックス順序
	int PaddingWay = 0;		// パディング手法
	int Half_width = 0;		// パディングの増加分(増加画像の幅/2)
	int Half_height = 0;	// パディングの増加分(増加画像の高さ/2)
	int Cols = 0;		// 画像の幅
	int Rows = 0;		// 画像の高さ
	int Sizes = 0;		// 画像の総ピクセル数
	int Xsize = 0;		// DFT後の画像の幅
	int Ysize = 0;		// DFT後の画像の高さ
	int XYsize = 0;		// DFT後の画像の総ピクセル数

	FTMat();			// 初期化
	FTMat(Mat& Input_ImgMat, int Input_checker);	// 入力指定による初期化(0:ImgMat,1:ImgVec,2:dft_ImgVec)

	void toMatrix(int Zero, int Order, int SizeX, int SizeY);						// 画像の2次元化
	void toVector(int Zero, int Order, int Padding, int DFTsizeX, int DFTsizeY);	// 画像の1次元化
	void DFT();		// forward DFT
	void iDFT();	// inverse DFT
	void settingA(int Zero, int Order, int SizeX, int SizeY);
	void settingB(int Zero, int Order, int Padding, int DFTsizeX, int DFTsizeY);

	void copyTo(FTMat& Output_FTMat);
	void output(Mat& Output_Img_gray);
	void resizeTo(FTMat& Output_FTMat, double ResizeFactor);
};
FTMat::FTMat() {
	x = 0, y = 0;
	zeroX = 0, zeroY = 0, zeroIndex = 0;
	Channels = 0;
	ZeroPoint = 0;
	IndexOrder = 0;
	PaddingWay = 0;
	Half_width = 0;
	Half_height = 0;
	Cols = 0;
	Rows = 0;
	Sizes = 0;
	Xsize = 0;
	Ysize = 0;
	XYsize = 0;
	ImgMat.release();
	ImgVec.release();
	dft_ImgVec.release();
}
FTMat::FTMat(Mat& Input_ImgMat, int Input_checker) {
	if (Input_checker == 0) {
		Channels = (int)Input_ImgMat.channels();
		if (Channels != 1) { cout << "WARNING! FTMat() : Input image is not 1 channel. It's " << Channels << " channels." << endl; }
		Input_ImgMat.convertTo(ImgMat, CV_64F);
		Cols = ImgMat.cols;
		Rows = ImgMat.rows;
		Sizes = Cols * Rows;
		ZeroPoint = 0;
		IndexOrder = 0;
		PaddingWay = 0;
		Xsize = 0;
		Ysize = 0;
		XYsize = 0;
		ImgVec.release();
		dft_ImgVec.release();
	}
	else if (Input_checker == 1) {
		Channels = (int)Input_ImgMat.channels();
		if (Channels != 1) { cout << "WARNING! FTMat() : Input image is not 1 channel. It's " << Channels << " channels." << endl; }
		Input_ImgMat.convertTo(ImgVec, CV_64F);
		Xsize = ImgVec.cols;
		Ysize = ImgVec.rows;
		XYsize = Xsize * Ysize;
		if (Ysize != 1) { cout << "WARNING! FTMat() : Input image is not 1D vector. The Matrix is (" << Xsize << ", " << Ysize << ")." << endl; }
		ZeroPoint = 0;
		IndexOrder = 0;
		PaddingWay = 0;
		Cols = 0;
		Rows = 0;
		Sizes = 0;
		ImgMat.release();
		dft_ImgVec.release();
	}
	else if (Input_checker == 2) {
		Channels = (int)Input_ImgMat.channels();
		if (Input_ImgMat.channels() != 2) { cout << "WARNING! FTMat() : Input image is not 2 channel. It's " << Channels << " channels." << endl; }
		else { Channels = 1; }
		Input_ImgMat.convertTo(dft_ImgVec, CV_64FC2);
		Xsize = 0;
		Ysize = 0;
		XYsize = Xsize * Ysize;
		ZeroPoint = 0;
		IndexOrder = 0;
		PaddingWay = 0;
		Cols = 0;
		Rows = 0;
		Sizes = 0;
		ImgMat.release();
		ImgVec.release();
	}
	else { cout << "ERROR! FTMat() : Input_checker is wrong." << endl; }
}
void FTMat::toMatrix(int Zero, int Order, int SizeX, int SizeY) {
	ZeroPoint = Zero;
	IndexOrder = Order;
	Cols = SizeX;
	Rows = SizeY;
	Sizes = Cols * Rows;

	// インデックスを指定して2次元ベクトルに変換
	Mat ImgMat_sub = Mat::zeros(Ysize, Xsize, CV_64F);
	zeroX = 0, zeroY = 0, zeroIndex;	// 左上ゼロ
	if (ZeroPoint == 1) { zeroX = (int)(Xsize / 2), zeroY = (int)(Ysize / 2); }	// 中心ゼロ
	else if (ZeroPoint != 0) { cout << "WARNNING! FTMat.toMatrix() : ZeroPoint is wrong." << endl; }
	zeroIndex = 0;
	if (IndexOrder == 0) {
		for (y = 0; y < Ysize; y++) {
			for (x = 0; x < Xsize; x++) {
				ImgMat_sub.at<double>(zeroY, zeroX) = ImgVec.at<double>(0, zeroIndex);
				zeroX++;
				if (zeroX >= Xsize) {
					zeroX = 0;
					zeroY++;
					if (zeroY >= Ysize) { zeroY = 0; }
				}
				zeroIndex++;
			}
		}
	}
	else if (IndexOrder == 1) {
		for (y = 0; y < Ysize; y++) {
			for (x = 0; x < Xsize; x++) {
				ImgMat_sub.at<double>(zeroY, zeroX) = ImgVec.at<double>(0, zeroIndex);
				zeroX--;
				if (zeroX < 0) {
					zeroX = Xsize - 1;
					zeroY--;
					if (zeroY < 0) { zeroY = Ysize - 1; }
				}
				zeroIndex++;
			}
		}
	}
	else { cout << "ERROR! FTMat.toMatrix() : IndexOrder is wrong." << endl; }

	// 最適な画像の切り出し
	Half_width = (int)((Xsize - Cols) / 2);
	Half_height = (int)((Ysize - Rows) / 2);
	if (Ysize == 0 || Xsize == 0) { cout << "ERROR! FTMat() : Use settingB()." << endl; }
	else { ImgMat = ImgMat_sub(Rect(Half_width, Half_height, Cols, Rows)); }
}
void FTMat::toVector(int Zero, int Order, int Padding, int DFTsizeX, int DFTsizeY) {
	ZeroPoint = Zero;
	IndexOrder = Order;
	PaddingWay = Padding;
	Xsize = DFTsizeX;
	Ysize = DFTsizeY;
	XYsize = Xsize * Ysize;

	// DFT変換のパディング幅を求める(縦横各拡大幅の半分)
	Half_width = (int)((Xsize - ImgMat.cols) / 2);
	Half_height = (int)((Ysize - ImgMat.rows) / 2);
	// DFT変換のパディング
	Mat Padding_ImgMat = Mat::zeros(Ysize, Xsize, CV_64F);
	if (PaddingWay == 0) { copyMakeBorder(ImgMat, Padding_ImgMat, Half_height, Ysize - ImgMat.rows - Half_height, Half_width, Xsize - ImgMat.cols - Half_width, BORDER_CONSTANT, 0.0); }
	else if (PaddingWay == 1) { copyMakeBorder(ImgMat, Padding_ImgMat, Half_height, Ysize - ImgMat.rows - Half_height, Half_width, Xsize - ImgMat.cols - Half_width, BORDER_REPLICATE); }
	else { cout << "ERROR! FTMat.toVector() : PaddingWay is wrong." << endl; }

	// インデックスを指定して1次元ベクトルに変換
	ImgVec = Mat::zeros(1, XYsize, CV_64F);
	zeroX = 0, zeroY = 0, zeroIndex;	// 左上ゼロ
	if (ZeroPoint == 1) { zeroX = (int)(Xsize / 2), zeroY = (int)(Ysize / 2); }	// 中心ゼロ
	else if (ZeroPoint != 0) { cout << "WARNNING! FTMat.toVector() : ZeroPoint is wrong." << endl; }
	zeroIndex = 0;
	if (IndexOrder == 0) {
		for (y = 0; y < Ysize; y++) {
			for (x = 0; x < Xsize; x++) {
				ImgVec.at<double>(0, zeroIndex) = Padding_ImgMat.at<double>(zeroY, zeroX);
				zeroX++;
				if (zeroX >= Xsize) {
					zeroX = 0;
					zeroY++;
					if (zeroY >= Ysize) { zeroY = 0; }
				}
				zeroIndex++;
			}
		}
	}
	else if (IndexOrder == 1) {
		for (y = 0; y < Ysize; y++) {
			for (x = 0; x < Xsize; x++) {
				ImgVec.at<double>(0, zeroIndex) = Padding_ImgMat.at<double>(zeroY, zeroX);
				zeroX--;
				if (zeroX < 0) {
					zeroX = Xsize - 1;
					zeroY--;
					if (zeroY < 0) { zeroY = Ysize - 1; }
				}
				zeroIndex++;
			}
		}
	}
	else { cout << "ERROR! FTMat.toVector() : IndexOrder is wrong." << endl; }
}
void FTMat::DFT() {
	Mat ImgVec_2D;
	// 複素数用に2チャンネルに変更
	Mat planes[] = { Mat_<double>(ImgVec), Mat::zeros(ImgVec.size(), CV_64F) };
	merge(planes, 2, ImgVec_2D);

	// DFT変換
	dft(ImgVec_2D, dft_ImgVec, 0);
}
void FTMat::iDFT() {
	ImgVec.release();
	// inverseDFT変換
	dft(dft_ImgVec, ImgVec, cv::DFT_INVERSE + cv::DFT_SCALE | cv::DFT_REAL_OUTPUT);
}
void FTMat::settingA(int Zero, int Order, int SizeX, int SizeY) {
	ZeroPoint = Zero;
	IndexOrder = Order;
	Cols = SizeX;
	Rows = SizeY;
	Sizes = Cols * Rows;
}
void FTMat::settingB(int Zero, int Order, int Padding, int DFTsizeX, int DFTsizeY) {
	ZeroPoint = Zero;
	IndexOrder = Order;
	PaddingWay = Padding;
	Xsize = DFTsizeX;
	Ysize = DFTsizeY;
	XYsize = Xsize * Ysize;
}
void FTMat::copyTo(FTMat& Output_FTMat) {
	Output_FTMat = FTMat();
	Channels = Output_FTMat.Channels;
	ZeroPoint = Output_FTMat.ZeroPoint;
	IndexOrder = Output_FTMat.IndexOrder;
	PaddingWay = Output_FTMat.PaddingWay;
	Cols = Output_FTMat.Cols;
	Rows = Output_FTMat.Rows;
	Sizes = Cols * Rows;
	Xsize = Output_FTMat.Xsize;
	Ysize = Output_FTMat.Ysize;
	XYsize = Xsize * Ysize;
	ImgMat.copyTo(Output_FTMat.ImgMat);
	ImgVec.copyTo(Output_FTMat.ImgVec);
	dft_ImgVec.copyTo(Output_FTMat.dft_ImgVec);
}
void FTMat::output(Mat& Output_Img_gray) {
	// 画像をCV_8Uに変換
	ImgMat.convertTo(Output_Img_gray, CV_8UC1);
}
void FTMat::resizeTo(FTMat& Output_FTMat, double ResizeFactor) {
	Output_FTMat = FTMat();
	Mat Resize_FTMat;
	resize(ImgMat, Resize_FTMat, Size(), ResizeFactor, ResizeFactor);
	Output_FTMat = FTMat(Resize_FTMat, 0);
}


/*--- KERNELクラス ----------------------------------------------------
	FTMatクラスを継承したカーネルクラス
	sum:				正規化時に総和を計算する
	cols, rows, size:	カーネルのサイズ (= Cols, Rows, Size)
-----------------------------------------------------------------------*/
class KERNEL : public FTMat {
private:
	int x = 0, y = 0;
	double sum = 0;
public:
	int cols = 0;		// カーネルの幅
	int rows = 0;		// カーネルの高さ
	int size = 0;		// カーネルの総ピクセル数

	KERNEL();				// カーネル初期化
	KERNEL(int FastOrder);	// 入力指定によるカーネル初期化
	KERNEL(Mat& InputMat);

	void normalization();					// カーネルの正規化
	void visualization(Mat& Output_Image);	// カーネルの可視化
	void copyTo(KERNEL& Output_Kernel);
	void resizeTo(KERNEL& Output_Kernel, double ResizeFactor);
};
KERNEL::KERNEL() {
	FTMat();
	x = 0, y = 0;
	sum = 0;
	cols = 0;
	rows = 0;
	size = 0;
}
KERNEL::KERNEL(int FastOrder) {
	int filetersize_cols = 40;
	int filetersize_rows = 40;
	Mat KernelImage = (Mat_<double>(filetersize_rows, filetersize_cols) 		// 40*40 (line)
		<< 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
		0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
		0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
		0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
		0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
		0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
		0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
		0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
		0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
		0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
		0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
		0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
		0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
		0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
		0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
		0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
		0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
		0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
		0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
		0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 100, 100, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
		0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 100, 100, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
		0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
		0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
		0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
		0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
		0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
		0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
		0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
		0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
		0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
		0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
		0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
		0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
		0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
		0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
		0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
		0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
		0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
		0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
		0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0);

	if (FastOrder == 0) {
		Mat KernelImage = (Mat_<double>(filetersize_rows, filetersize_cols)
			<< 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
			0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
			0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
			0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
			0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
			0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
			0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
			0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
			0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
			0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
			0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
			0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
			0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
			0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
			0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
			0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
			0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
			0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
			0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
			0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 100, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
			0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
			0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
			0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
			0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
			0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
			0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
			0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
			0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
			0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
			0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
			0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
			0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
			0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
			0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
			0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
			0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
			0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
			0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
			0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
			0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0);
		cout << " KERNEL(int 0) set" << endl;		// 確認用
	}
	else if (FastOrder == 1) {
		KernelImage = (Mat_<double>(filetersize_rows, filetersize_cols)
			<< 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
			0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
			0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
			0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
			0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
			0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 10, 10, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
			0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 10, 10, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
			0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 10, 20, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
			0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 20, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
			0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 20, 10, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
			0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 20, 10, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
			0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 10, 20, 10, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
			0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 10, 50, 20, 10, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
			0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 10, 130, 30, 10, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
			0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 10, 140, 30, 10, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
			0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 30, 150, 40, 10, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
			0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 20, 150, 30, 10, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
			0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 30, 150, 20, 10, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
			0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 20, 80, 10, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
			0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 10, 30, 50, 30, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
			0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 10, 10, 40, 30, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
			0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 10, 30, 20, 20, 10, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
			0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 10, 30, 30, 10, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
			0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 30, 30, 10, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
			0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 10, 20, 20, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
			0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 10, 20, 10, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
			0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 10, 20, 10, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
			0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 10, 20, 10, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
			0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 10, 10, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
			0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 10, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
			0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 20, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
			0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 10, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
			0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
			0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
			0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
			0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
			0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
			0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
			0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
			0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0);
		cout << " KERNEL(int 1) set" << endl;		// 確認用
	}
	else if (FastOrder == 2) {
		KernelImage = (Mat_<double>(filetersize_rows, filetersize_cols)
			<< 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
			0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
			0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
			0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
			0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
			0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
			0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
			0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
			0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 10, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
			0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 10, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
			0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 10, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
			0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 10, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
			0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 10, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
			0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 10, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
			0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 10, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
			0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 10, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
			0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 10, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
			0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 10, 10, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
			0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 10, 10, 10, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
			0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 10, 10, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
			0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 10, 10, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
			0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 10, 10, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
			0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 10, 10, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
			0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 10, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
			0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 10, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
			0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 10, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
			0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 10, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
			0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 10, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
			0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
			0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
			0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
			0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
			0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
			0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
			0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
			0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
			0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
			0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
			0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
			0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0);
		cout << " KERNEL(int 2) set" << endl;		// 確認用
	}
	else if (FastOrder == 3) {
		KernelImage = (Mat_<double>(filetersize_rows, filetersize_cols)
			<< 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
			0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
			0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
			0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
			0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
			0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
			0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
			0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
			0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
			0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
			0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
			0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
			0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
			0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
			0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 5, 10, 10, 5, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
			0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 10, 20, 30, 30, 20, 10, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
			0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 20, 30, 40, 55, 55, 40, 30, 20, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
			0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 10, 30, 50, 60, 75, 75, 60, 50, 30, 10, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
			0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 5, 20, 40, 60, 80, 90, 90, 80, 60, 40, 20, 5, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
			0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 10, 30, 55, 75, 90, 100, 100, 90, 75, 55, 30, 10, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
			0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 10, 30, 55, 75, 90, 100, 100, 90, 75, 55, 30, 10, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
			0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 5, 20, 40, 60, 80, 90, 90, 80, 60, 40, 20, 5, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
			0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 10, 30, 50, 60, 75, 75, 60, 50, 30, 10, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
			0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 20, 30, 40, 55, 55, 40, 30, 20, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
			0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 10, 20, 30, 30, 20, 10, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
			0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 5, 10, 10, 5, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
			0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
			0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
			0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
			0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
			0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
			0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
			0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
			0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
			0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
			0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
			0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
			0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
			0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
			0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0);
		cout << " KERNEL(int 3) set" << endl;		// 確認用
	}
	else { cout << " KERNEL(delta kernel) set" << endl; }	// 確認用
	cols = KernelImage.cols;
	rows = KernelImage.rows;
	size = cols * rows;

	sum = 0.0;
#pragma omp parallel for private(x)
	for (y = 0; y < rows; y++) {
		for (x = 0; x < cols; x++) {
			sum += (double)KernelImage.at<double>(y, x);
		}
	}
	KernelImage /= (double)sum;

	Channels = 1;
	KernelImage.copyTo(ImgMat);
	Cols = ImgMat.cols;
	Rows = ImgMat.rows;
	Sizes = Cols * Rows;
	ZeroPoint = 0;
	IndexOrder = 0;
	PaddingWay = 0;
	Xsize = 0;
	Ysize = 0;
	XYsize = 0;
	ImgVec.release();
	dft_ImgVec.release();
}
KERNEL::KERNEL(Mat& InputMat) {
	FTMat();
	int filetersize_cols = InputMat.cols;
	int filetersize_rows = InputMat.rows;

	Mat KernelImage;
	InputMat.convertTo(KernelImage, CV_64F);
	cols = KernelImage.cols;
	rows = KernelImage.rows;
	size = cols * rows;

	sum = 0.0;
#pragma omp parallel for private(x)
	for (y = 0; y < rows; y++) {
		for (x = 0; x < cols; x++) {
			sum += (double)KernelImage.at<double>(y, x);
		}
	}
	KernelImage /= (double)sum;

	Channels = 1;
	KernelImage.copyTo(ImgMat);
	Cols = ImgMat.cols;
	Rows = ImgMat.rows;
	Sizes = Cols * Rows;
	ZeroPoint = 0;
	IndexOrder = 0;
	PaddingWay = 0;
	Xsize = 0;
	Ysize = 0;
	XYsize = 0;
	ImgVec.release();
	dft_ImgVec.release();
}
void KERNEL::normalization() {
	/* 総和を計算 */
	sum = 0.0;
#pragma omp parallel for private(x)
	for (y = 0; y < ImgMat.rows; y++) {
		for (x = 0; x < ImgMat.cols; x++) {
			sum += (double)ImgMat.at<double>(y, x);
		}
	}

	double multi_sum = 1.0 / (double)sum;		// 総和が１になるような係数
	/* 総和を１にする */
	double calc_sum;
#pragma omp parallel for private(x)
	for (y = 0; y < ImgMat.rows; y++) {
		for (x = 0; x < ImgMat.cols; x++) {
			calc_sum = (double)ImgMat.at<double>(y, x);
			calc_sum *= multi_sum;
			ImgMat.at<double>(y, x) = calc_sum;
		}
	}
}
void KERNEL::visualization(Mat& Output_Image) {
	normalize(ImgMat, Output_Image, 0, 255, NORM_MINMAX);
	Output_Image.convertTo(Output_Image, CV_8UC1);
}
void KERNEL::copyTo(KERNEL& Output_Kernel) {
	Output_Kernel = KERNEL();
	Output_Kernel.Channels = Channels;
	Output_Kernel.ZeroPoint = ZeroPoint;
	Output_Kernel.IndexOrder = IndexOrder;
	Output_Kernel.PaddingWay = PaddingWay;
	Output_Kernel.Cols = Cols;
	Output_Kernel.Rows = Rows;
	Output_Kernel.Sizes = Cols * Rows;
	Output_Kernel.Xsize = Xsize;
	Output_Kernel.Ysize = Ysize;
	Output_Kernel.XYsize = Xsize * Ysize;
	ImgMat.copyTo(Output_Kernel.ImgMat);
	ImgVec.copyTo(Output_Kernel.ImgVec);
	dft_ImgVec.copyTo(Output_Kernel.dft_ImgVec);
	Output_Kernel.cols = Cols;
	Output_Kernel.rows = Rows;
	Output_Kernel.size = cols * rows;
}
void KERNEL::resizeTo(KERNEL& Output_Kernel, double ResizeFactor) {
	Output_Kernel = KERNEL();
	Mat Resize_KernelImage;
	resize(ImgMat, Resize_KernelImage, Size(), ResizeFactor, ResizeFactor);
	Output_Kernel = KERNEL(Resize_KernelImage);
}


/*--- FTMat3Dクラス ---------------------------------------------------
	FTMatクラスでRGB画像扱うための画像クラス
		FT_Mat[0]:	カラー画像のB
		FT_Mat[1]:	カラー画像のG
		FT_Mat[2]:	カラー画像のR
-----------------------------------------------------------------------*/
class FTMat3D {
private:
	int c = 3;
public:
	vector<FTMat> FT_Mat;	// 2次元RGB画像
	double AverageColor[3] = { 0.0, 0.0, 0.0 };

	FTMat3D();				// 初期化
	FTMat3D(Mat& Input_ImgMat_color);									// 入力指定による初期化(ImgMat)
	FTMat3D(Mat& dft_ImgVec_0, Mat& dft_ImgVec_1, Mat& dft_ImgVec_2);	// 入力指定による初期化(dft_ImgVec)

	void toMatrix(int Zero, int Order, int SizeX, int SizeY);						// 画像の2次元化
	void toVector(int Zero, int Order, int Padding, int DFTsizeX, int DFTsizeY);	// 画像の1次元化
	void DFT();		// forward DFT
	void iDFT();	// inverse DFT
	void settingA(int Zero, int Order, int SizeX, int SizeY);
	void settingB(int Zero, int Order, int Padding, int DFTsizeX, int DFTsizeY);
	void settingAverageColor(FTMat3D& Input);
	void copyTo(FTMat3D& Output_FTMat);
	void output(Mat& Output_Img_color);
	void resizeTo(FTMat3D& Output_FTMat3D, double ResizeFactor);
};
FTMat3D::FTMat3D() {
	FT_Mat.clear();
}
FTMat3D::FTMat3D(Mat& Input_ImgMat_color) {
	FT_Mat.clear();
	if (Input_ImgMat_color.channels() != 3) { cout << "WARNING! FTMat3D() : Input image is not 3 channel. It's " << (int)Input_ImgMat_color.channels() << " channels." << endl; }
	else {
		// 画像をCV_64Fに変換 (3つのチャネルB, G, Rに分離)
		Mat Input_doubleImgMat;
		Input_ImgMat_color.convertTo(Input_doubleImgMat, CV_64FC3);
		Mat doubleImgMat[3] = { Mat::zeros(Input_doubleImgMat.size(), CV_64F), Mat::zeros(Input_doubleImgMat.size(), CV_64F), Mat::zeros(Input_doubleImgMat.size(), CV_64F) };
		split(Input_doubleImgMat, doubleImgMat);

		// 画像をFTMatに変換
		for (c = 0; c < 3; c++) {
			// 画像を0-1正規化
			doubleImgMat[c].convertTo(doubleImgMat[c], CV_64F, 1.0 / 255);

			// 画像を中心化
			AverageColor[c] = (double)mean(doubleImgMat[c])[0];
			doubleImgMat[c] -= AverageColor[c];

			FTMat Input_ImgMat = FTMat(doubleImgMat[c], 0);
			FT_Mat.push_back(Input_ImgMat);
		}
		//cout << " FTMat3D() : - AverageColor = [" << AverageColor[0] << ", " << AverageColor[1] << ", " << AverageColor[2] << "]" << endl;
	}
}
FTMat3D::FTMat3D(Mat& dft_ImgVec_0, Mat& dft_ImgVec_1, Mat& dft_ImgVec_2) {
	FT_Mat.clear();
	if (dft_ImgVec_0.channels() != 2 || dft_ImgVec_1.channels() != 2 || dft_ImgVec_2.channels() != 2) {
		cout << "WARNING! FTMat3D() : Input image is not 2 channel." << endl;
	}
	else {
		Mat dft_doubleImgVec[3];
		dft_ImgVec_0.copyTo(dft_doubleImgVec[0]);
		dft_ImgVec_1.copyTo(dft_doubleImgVec[1]);
		dft_ImgVec_2.copyTo(dft_doubleImgVec[2]);

		// 画像をFTMatに変換
		for (c = 0; c < 3; c++) {
			FTMat Input_ImgMat = FTMat(dft_doubleImgVec[c], 2);
			FT_Mat.push_back(Input_ImgMat);
		}
	}
}
void FTMat3D::toMatrix(int Zero, int Order, int SizeX, int SizeY) {
	for (c = 0; c < 3; c++) {
		FT_Mat[c].toMatrix(Zero, Order, SizeX, SizeY);
	}
}
void FTMat3D::toVector(int Zero, int Order, int Padding, int DFTsizeX, int DFTsizeY) {
	for (c = 0; c < 3; c++) {
		FT_Mat[c].toVector(Zero, Order, Padding, DFTsizeX, DFTsizeY);
	}
}
void FTMat3D::DFT() {
	for (c = 0; c < 3; c++) {
		FT_Mat[c].DFT();
	}
}
void FTMat3D::iDFT() {
	for (c = 0; c < 3; c++) {
		FT_Mat[c].iDFT();
	}
}
void FTMat3D::settingA(int Zero, int Order, int SizeX, int SizeY) {
	for (c = 0; c < 3; c++) {
		FT_Mat[c].settingA(Zero, Order, SizeX, SizeY);
	}
}
void FTMat3D::settingB(int Zero, int Order, int Padding, int DFTsizeX, int DFTsizeY) {
	for (c = 0; c < 3; c++) {
		FT_Mat[c].settingB(Zero, Order, Padding, DFTsizeX, DFTsizeY);
	}
}
void FTMat3D::settingAverageColor(FTMat3D& Input) {
	for (c = 0; c < 3; c++) {
		AverageColor[c] = Input.AverageColor[c];
	}
}
void FTMat3D::copyTo(FTMat3D& Output_FTMat) {
	Output_FTMat = FTMat3D();
	for (c = 0; c < 3; c++) {
		Output_FTMat.FT_Mat.push_back(FT_Mat[c]);
		Output_FTMat.AverageColor[c] = AverageColor[c];
	}
}
void FTMat3D::output(Mat& Output_Img_color) {
	// 3つのチャネルB, G, Rを統合
	Mat doubleImgMat[3];
	for (c = 0; c < 3; c++) {
		FT_Mat[c].ImgMat.copyTo(doubleImgMat[c]);

		// 画像を中心化復元
		doubleImgMat[c] += AverageColor[c];

		// 画像を0-255化
		doubleImgMat[c].convertTo(doubleImgMat[c], CV_64F, 255);
	}
	//cout << " FTMat3D() : + AverageColor = [" << AverageColor[0] << ", " << AverageColor[1] << ", " << AverageColor[2] << "]" << endl;
	if (AverageColor[0] == 0 && AverageColor[1] == 0 && AverageColor[2] == 0) { cout << "WARNING! FTMat3D() : Set AverageColors." << endl; }
	merge(doubleImgMat, 3, Output_Img_color);

	// 画像をCV_8Uに変換
	Output_Img_color.convertTo(Output_Img_color, CV_8UC3);
}
void FTMat3D::resizeTo(FTMat3D& Output_FTMat3D, double ResizeFactor) {
	for (c = 0; c < 3; c++) {
		FT_Mat[c].resizeTo(Output_FTMat3D.FT_Mat[c], ResizeFactor);
	}
}



#endif